#include <iostream>
using namespace std ; 

/*此程序由南京工业大学计软1701鲁澳于2017.10.2制作，用于将输出的任何一个五位数的没一个数位分解出来*/

int main() 
{
	int rand , n1 , n2 , n3 , n4 , n5 ; 
    cout << "请输入一个随机数" ;
	cin >>  rand ;
//求第五位数字 
	n1 = rand % 10000 ;
	n2 = n1 % 1000 ;
	n3 = n2 % 100 ;
	n4 = n3 % 10 ;
	n5 = n4 ;
//求第四位数字
    n4 = ( n3 - n5 ) / 10 ;
//求第三个数字
    n3 = ( n2 - n3 ) /100 ;
//求第二个数字
    n2 = ( n1 -n2 ) / 1000 ;
//求第一个数字
    n1 = ( rand - n1 ) / 10000 ; 
	cout << n1 << "   " << n2 << "   " << n3 << "   " << n4 << "   " << n5 ;
	return 0;
}
